library(foreign)
library(dplyr)
library(ggplot2)
library(readxl)

# (1) csv 읽어오기 
# (2) "-"값을 0으로 
# (3) 필요없는 변수 제거
# (4) rename 
# (5) "," 제거 
# (6) 데이터 프레임 만들기 

df <- read.csv(file = "범죄자범행시성별연령_2016년_.csv", stringsAsFactor = F)
df <- replace(df, df == "-", 0)
df

df<-df[, -c(3,5,6,7,8,9,10,11,12,14,15,16,17,18,19,20,21)] # 필요없는 변수 제거  
df

names(df) <- c("name1", "name2", "male", "female") # 변수 이름 바꾸기 
df

# df[, 3:21]<-sapply(df[, 3:21], function(a){as.numeric(as.character(a))})
# str(df)

df <- gsub(",", "", df) # 콤마를 제거 
df
str(df)
View(df)

name2 <- c("살인기수", "살인미수등", "강도", "강간", "유사강간", "강제추행", "기타 강간 강제추행등", "방화", "절도범죄", "상해", "폭행", "체포 감금", "협박", "약취 유인", "폭력행위등", "공갈", "손괴", "직무유기", "직권남용", "증수뢰", "통화", "문서 인장", "유가증권인지", "사기", "횡령", "배임", "성풍속범죄", "도박범죄", "특별경제범죄", "마약범죄", "보건범죄", "환경범죄", "교통범죄", "노동범죄", "안보범죄", "선거범죄", "병역범죄", "기타범죄")
name2

male <- c("297", "555", "1549", "5762", "591", "15657", "514", "1171", "81936", "55556", "180760", "1404", "15118", "212", "32948", "3175", "30124", "524", "512", "730", "207", "13163", "318", "173825", "27993", "6138", "10708", "29165", "59877", "6460", "11479", "3392", "473064", "3504", "133", "1221", "15528", "235245")
male
male <- as.numeric(male)

female <- c("82", "61", "167", "67", "7", "359", "7", "225", "24479", "10139", "36097", "283", "1707", "93", "8015", "463", "4871", "118", "65", "58", "13", "4861", "55", "49385", "7590", "1470", "499", "4777", "17792", "1983", "10170", "410", "82288", "2356", "18", "304", "131", "75625")
female
female <- as.numeric(female)

df_sex <- data.frame(name2, male, female)
df_sex
str(df_sex)
View(df_sex)

df_sex %>% select(name2, male, female) %>%
  arrange(desc(male)) %>%
  head(5)

# df[, 3:21]<-sapply(df[, 3:21], function(a){as.numeric(as.character(a))})
# str(df)

ggplot(data = df_sex, aes(x = name2, y = male)) + 
  geom_col() 

